using UnityEngine;
using TMPro;
using System.Collections.Generic;

public class WhereToController : MonoBehaviour
{
  [SerializeField] private GameObject _numberOfClassroom;
  [SerializeField] private GameObject _classRoomInfo;
  public void OnClick()
  {
    _numberOfClassroom.GetComponent<TMP_Text>().text = gameObject.name;
    Collection(gameObject.name);
  }

  public void Collection(string _name)
  {
    var Info = new Dictionary<string, string>
    {
      {"Кабинет №7","Кафедра интеллектуальных систем информационной безопасности - КБ-4"},
      {"Кабинет №8","Учебная аудитория"},
      {"Кабинет №8А","Информация о кабинете 8А"},
      {"Кабинет №8Б","Информация о кабинете 8Б"},
      {"Кабинет №8В","Информация о кабинете 8В"},
      {"Кабинет №9","Информация о кабинете 9"},
      {"Кабинет №10","Заместитель директора по стратегическому развитию - Григорьев В.Р"},
      {"Кабинет №10А","Информация о кабинете 10А"},
      {"Кабинет №10Б","Информация о кабинете 10Б"},
      {"Кабинет №11","Кафедра прикладных информационных технологий - КБ-2"},
      {"Кабинет №12","Директор ИКБСП - Бакаев А.А"},
      {"Кабинет №12А","Информация о кабинете 12А"},
      {"Кабинет №12Б","Информация о кабинете 12Б"},
      {"Кабинет №13","Кафедра интеллектуальных систем информационной безопасности - КБ-4 (2)"},
      {"Кабинет №14","Преподавательская"},
      {"Кабинет №14А","Информация о кабинете 14А"},
      {"Кабинет №15","Спец.лаба №2"},
      {"Кабинет №16","Заведующий кафедры КБ-2 - Трубиенко Олег Владимирович"},
      {"Кабинет №18","Заведующий кафедры КБ-4 - Магомедов Шамиль Гасангусейнович"},
      {"Кабинет №20","Преподавательская"},
      {"Кабинет №20В","Информация о кабинете 20В"},
      {"Кабинет №22","Преподавательская"},
      {"Кабинет №23","Центр мониторинга киберугроз"},
      {"Кабинет №24","Лаборатория КБ-8"},
      {"Кабинет №24А","Информация о кабинете 24А"},
      {"Кабинет №28","Информация о кабинете 28"},
      {"Кабинет №32","Компьютерный класс КБ-2"},
      {"Кабинет №34","Компьютерный класс КБ-2"},
      {"Кабинет №38","Аудитория для самостоятельных работ"},
      {"Туалет","Просто туалет"},
      {"Вход/Выход","Можно войти или выйти"},
    };
    foreach(var rooms in Info)
    {
      if(rooms.Key == _name)
      {
        _classRoomInfo.GetComponent<TMP_Text>().text = rooms.Value;
      }
    }
  }
}
